mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
/* Copyright (C) 2020 Thomas Jespersen, TKJ Electronics. All rights reserved.
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the MIT License
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the MIT License for further details.
 *
 * Contact information
 * ------------------------------------------
 * Thomas Jespersen, TKJ Electronics
 * Web      :  http://www.tkjelectronics.dk
 * e-mail   :  thomasj@tkjelectronics.dk
 * ------------------------------------------
 */
 
#include "SyncedPWMADC.h"
#include "stm32g4xx_hal.h"
#include "Debug.h"
#include <string.h> // for memset
#include <math.h> // for roundf
 
#ifndef USE_FREERTOS
#include <malloc.h>
#endif

SyncedPWMADC * SyncedPWMADC::globalObject = 0;

// Necessary to export for compiler to generate code to be called by interrupt vector
extern "C" __EXPORT void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc);

SyncedPWMADC::SyncedPWMADC(uint32_t frequency, float maxDuty)
{
	if (globalObject) {
		ERROR("Synced PWM/ADC object has already been created once");
		return;
	}
	globalObject = this;

	// Default settings
	timerSettingsNext.Frequency = frequency;
	timerSettingsNext.DutyCycle = 0;
	timerSettingsNext.Direction = true;
	_PWM_maxDuty = maxDuty;
	if (SAMPLE_IN_EVERY_PWM_CYCLE) {
		_samplingInterval = 1; // sample every PWM period
	} else {
		_samplingInterval = 2; // sample every second PWM period (with SAMPLE_IN_EVERY_PWM_CYCLE=false, this is the fastest possible)
	}
	_samplingNumSamples = 1; // capture samples from one PWM period after every interval (hence every PWM period)
	_DMA_ADC1_ongoing = false;
	_DMA_ADC2_ongoing = false;
	_TimerEnabled = false;
	_SamplingEnabled = false;

#ifdef USE_FREERTOS
	_sampleAvailable = xSemaphoreCreateBinary();
	if (_sampleAvailable == NULL) {
		ERROR("Could not create ADC-PWM Sample available semaphore");
		return;
	}
	vQueueAddToRegistry(_sampleAvailable, "ADC-PWM Sample Available");
#else
	_sampleAvailable = false;
#endif

	ConfigureDigitalPins();
	ConfigureAnalogPins();
	InitOpAmps();
	InitADCs(); // configures ADC in Current sense mode
	InitDMAs();
	InitTimer(frequency); // configures PWM in Brake mode
	RecomputePredefinedCounts();

	StartSampling();
	StartPWM();
}

SyncedPWMADC::~SyncedPWMADC()
{
	StopPWM();
	StopSampling();

	DeInitTimer();
	DeInitDMAs();
	DeInitADCs();
	DeInitOpAmps();
	DeInitAnalogPins();
	DeInitDigitalPins();
}

void SyncedPWMADC::SetOperatingMode(OperatingMode_t mode)
{
	_OperatingMode = mode;

	if (_OperatingMode == BRAKE) {
		ADC_ConfigureCurrentSenseSampling();
		Timer_ConfigureBrakeMode();
	}
	else if (_OperatingMode == COAST) {
		ADC_ConfigureBackEMFSampling();
		Timer_ConfigureCoastMode(timerSettingsCurrent.Direction);
	}
}

void SyncedPWMADC::SetPWMFrequency(uint32_t frequency)
{
	Timer_Configure(frequency);
	RecomputePredefinedCounts(); // recompute at different frequency
}

void SyncedPWMADC::SetDutyCycle(float duty)
{
	timerSettingsNext.DutyCycle = duty;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;
}

float SyncedPWMADC::GetCurrentDutyCycle()
{
	return timerSettingsCurrent.DutyCycle;
}

void SyncedPWMADC::RecomputePredefinedCounts()
{
	const uint32_t ADC_SAMPLE_TIME_US = _ADC_SampleTime_Total_us + ADC_SAMPLE_TIME_OVERHEAD_US;
	const uint16_t PWM_RIPPLE_TIME_US = ADC_PWM_RIPPLE_TIME_US;

	// Duty cycle is defined as:
	// Duty Cycle = (CCR+1) / (ARR+1)
	// So 100% duty cycle is achieved by setting CCR=ARR
	// Note that CCR is the Capture Compare Register value, computed as
	// CCR = (Duty * (ARR+1)) - 1
	PredefinedCounts.End = hTimer.Init.Period + 1; // ARR+1

	// Sample_DutyPct = ADC_SAMPLE_TIME_US*1e-6 / (1/PWM_frequency)
	float Sample_DutyPct = (float)((uint32_t)(timerSettingsNext.Frequency) * ADC_SAMPLE_TIME_US) / 1000000.f;
	PredefinedCounts.Sample = (uint16_t)(ceilf( fabsf(Sample_DutyPct)*PredefinedCounts.End ));

	float Ripple_DutyPct = (float)((uint32_t)(timerSettingsNext.Frequency) * PWM_RIPPLE_TIME_US) / 1000000.f;
	PredefinedCounts.Ripple = (uint16_t)(ceilf( fabsf(Ripple_DutyPct)*PredefinedCounts.End ));
}

void SyncedPWMADC::SetDutyCycle_MiddleSampling(float dutyPct)
{
	timerSettingsNext.DutyCycle = dutyPct;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;

	const uint16_t& End_Count = PredefinedCounts.End;
	const uint16_t& Ripple_Count = PredefinedCounts.Ripple;
	const uint16_t& Sample_Count = PredefinedCounts.Sample;
	// Duty cycle is defined as:
	// Duty Cycle = (CCR+1) / (ARR+1)
	// So 100% duty cycle is achieved by setting CCR=ARR
	const uint16_t Duty_Count = (uint16_t)(roundf( fabsf(timerSettingsNext.DutyCycle)*End_Count )); // note that from testing I have identified that it is more accurate not to subtract -1 here

	// Sanity check
	if (End_Count <= Sample_Count) {
		ERROR("PWM frequency is too fast for ADC sampling at the configured ADC sample time");
	}
	if (End_Count <= Ripple_Count) {
		ERROR("PWM frequency is faster than the expected ripple");
	}

	// Put the sample location as close to the end as possible
	uint16_t sampleLocation1 = 0;
	uint16_t sampleLocation2 = 0;

	// Find mid-point in ON period without LOW-to-HIGH switching ripple
	if ((Duty_Count+Ripple_Count)/2 > (Ripple_Count+Sample_Count)) {
		sampleLocation1 = (Duty_Count+Ripple_Count)/2 - Sample_Count;
	}
	// Find mid-point in OFF period without HIGH-to-LOW switching ripple
	if (((End_Count+Duty_Count+Ripple_Count)/2 - Sample_Count) > (Duty_Count+Ripple_Count)) {
		sampleLocation2 = (End_Count+Duty_Count+Ripple_Count)/2 - Sample_Count;
	}

	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_5, sampleLocation1);
	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_6, sampleLocation2);

	if (DEBUG_MODE_ENABLED) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_2, sampleLocation1);
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_4, sampleLocation2);
	}

	if (timerSettingsNext.DutyCycle >= 0) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, Duty_Count); // control the duty cycle with the other side of the motor
	} else {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, Duty_Count); // control the duty cycle with the other side of the motor
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
	}

	if (_OperatingMode == COAST) {
		Timer_ConfigureCoastMode(timerSettingsNext.Direction);
	}

	timerSettingsNext.Triggers.numEnabledTriggers = 0;
	if (sampleLocation1 > 0) {
		timerSettingsNext.Triggers.ON.Enabled = true;
		timerSettingsNext.Triggers.ON.Index = 0;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.ON.Enabled = false;
	}
	if (sampleLocation2 > 0) {
		timerSettingsNext.Triggers.OFF.Enabled = true;
		timerSettingsNext.Triggers.OFF.Index = timerSettingsNext.Triggers.numEnabledTriggers;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.OFF.Enabled = false;
	}
	timerSettingsNext.Triggers.ON.Location = sampleLocation1;
	timerSettingsNext.Triggers.OFF.Location = sampleLocation2;

	// When we sample in every cycle the DMA is not triggered periodically but only configured and enabled once. So we need to reconfigure the DMA if we changed the number of triggers
	if (SAMPLE_IN_EVERY_PWM_CYCLE && timerSettingsNext.Triggers.numEnabledTriggers != timerSettingsCurrent.Triggers.numEnabledTriggers) {
		RestartSampling();
	}
}

