mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
void SyncedPWMADC::SetDutyCycle_EndSampling(float dutyPct)
{
	timerSettingsNext.DutyCycle = dutyPct;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;

	const uint16_t& End_Count = PredefinedCounts.End;
	const uint16_t& Ripple_Count = PredefinedCounts.Ripple;
	const uint16_t& Sample_Count = PredefinedCounts.Sample;
	// Duty cycle is defined as:
	// Duty Cycle = (CCR+1) / (ARR+1)
	// So 100% duty cycle is achieved by setting CCR=ARR
	const uint16_t Duty_Count = (uint16_t)(roundf( fabsf(timerSettingsNext.DutyCycle)*End_Count )); // note that from testing I have identified that it is more accurate not to subtract -1 here

	// Sanity check
	if (End_Count <= Sample_Count) {
		ERROR("PWM frequency is too fast for ADC sampling at the configured ADC sample time");
	}
	if (End_Count <= Ripple_Count) {
		ERROR("PWM frequency is faster than the expected ripple");
	}

	// Put the sample location as close to the end as possible
	uint16_t sampleLocation1 = 0;
	uint16_t sampleLocation2 = 0;

	if (Duty_Count > (Ripple_Count+Sample_Count)) {
		sampleLocation1 = Duty_Count - Sample_Count;
	}
	if ((End_Count - Sample_Count) > (Duty_Count+Ripple_Count)) {
		sampleLocation2 = End_Count - Sample_Count;
	}

	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_5, sampleLocation1);
	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_6, sampleLocation2);

	if (DEBUG_MODE_ENABLED) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_2, sampleLocation1);
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_4, sampleLocation2);
	}

	if (timerSettingsNext.DutyCycle >= 0) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, Duty_Count); // control the duty cycle with the other side of the motor
	} else {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, Duty_Count); // control the duty cycle with the other side of the motor
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
	}

	if (_OperatingMode == COAST) {
		Timer_ConfigureCoastMode(timerSettingsNext.Direction);
	}

	timerSettingsNext.Triggers.numEnabledTriggers = 0;
	if (sampleLocation1 > 0) {
		timerSettingsNext.Triggers.ON.Enabled = true;
		timerSettingsNext.Triggers.ON.Index = 0;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.ON.Enabled = false;
	}
	if (sampleLocation2 > 0) {
		timerSettingsNext.Triggers.OFF.Enabled = true;
		timerSettingsNext.Triggers.OFF.Index = timerSettingsNext.Triggers.numEnabledTriggers;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.OFF.Enabled = false;
	}
	timerSettingsNext.Triggers.ON.Location = sampleLocation1;
	timerSettingsNext.Triggers.OFF.Location = sampleLocation2;

	// When we sample in every cycle the DMA is not triggered periodically but only configured and enabled once. So we need to reconfigure the DMA if we changed the number of triggers
	if (SAMPLE_IN_EVERY_PWM_CYCLE && timerSettingsNext.Triggers.numEnabledTriggers != timerSettingsCurrent.Triggers.numEnabledTriggers) {
		RestartSampling();
	}
}


void SyncedPWMADC::SetDutyCycle_MiddleSamplingOnce(float dutyPct)
{
	timerSettingsNext.DutyCycle = dutyPct;

	if (timerSettingsNext.DutyCycle > _PWM_maxDuty)
		timerSettingsNext.DutyCycle = _PWM_maxDuty;
	else if (timerSettingsNext.DutyCycle < -_PWM_maxDuty)
		timerSettingsNext.DutyCycle = -_PWM_maxDuty;

	if (timerSettingsNext.DutyCycle > 0)
		timerSettingsNext.Direction = true;
	else if (timerSettingsNext.DutyCycle < 0)
		timerSettingsNext.Direction = false;

	const uint16_t& End_Count = PredefinedCounts.End;
	const uint16_t& Ripple_Count = PredefinedCounts.Ripple;
	const uint16_t& Sample_Count = PredefinedCounts.Sample;
	// Duty cycle is defined as:
	// Duty Cycle = (CCR+1) / (ARR+1)
	// So 100% duty cycle is achieved by setting CCR=ARR
	const uint16_t Duty_Count = (uint16_t)(roundf( fabsf(timerSettingsNext.DutyCycle)*End_Count )); // note that from testing I have identified that it is more accurate not to subtract -1 here

	// Sanity check
	if (End_Count <= Sample_Count) {
		ERROR("PWM frequency is too fast for ADC sampling at the configured ADC sample time");
	}
	if (End_Count <= Ripple_Count) {
		ERROR("PWM frequency is faster than the expected ripple");
	}

	// Put the sample location as close to the end as possible
	uint16_t sampleLocation1 = 0;
	uint16_t sampleLocation2 = 0;

	// Find mid-point in ON period without LOW-to-HIGH switching ripple
	if ((Duty_Count+Ripple_Count)/2 > (Ripple_Count+Sample_Count)) {
		sampleLocation1 = (Duty_Count+Ripple_Count)/2 - Sample_Count;
	}
	// Find mid-point in OFF period without HIGH-to-LOW switching ripple
	if (((End_Count+Duty_Count+Ripple_Count)/2 - Sample_Count) > (Duty_Count+Ripple_Count)) {
		sampleLocation2 = (End_Count+Duty_Count+Ripple_Count)/2 - Sample_Count;
	}

	// Sample EITHER in the middle of the ON-period or in the middle of the OFF-period
	if (timerSettingsNext.DutyCycle >= 0.5 && sampleLocation1 > 0) {
		sampleLocation2 = 0; // since the ON-period is longest, remove sampling from the OFF-period
	} else {
		sampleLocation1 = 0; // since the OFF-period is longest, remove sampling from the ON-period
	}

	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_5, sampleLocation1);
	__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_6, sampleLocation2);

	if (DEBUG_MODE_ENABLED) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_2, sampleLocation1);
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_4, sampleLocation2);
	}

	if (timerSettingsNext.DutyCycle >= 0) {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, Duty_Count); // control the duty cycle with the other side of the motor
	} else {
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_1, Duty_Count); // control the duty cycle with the other side of the motor
		__HAL_TIM_SET_COMPARE(&hTimer, TIM_CHANNEL_3, 0); // set one side of the motor to LOW all the time  (necessary to be able to measure current through Shunt1)
	}

	if (_OperatingMode == COAST) {
		Timer_ConfigureCoastMode(timerSettingsNext.Direction);
	}

	timerSettingsNext.Triggers.numEnabledTriggers = 0;
	if (sampleLocation1 > 0) {
		timerSettingsNext.Triggers.ON.Enabled = true;
		timerSettingsNext.Triggers.ON.Index = 0;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.ON.Enabled = false;
	}
	if (sampleLocation2 > 0) {
		timerSettingsNext.Triggers.OFF.Enabled = true;
		timerSettingsNext.Triggers.OFF.Index = timerSettingsNext.Triggers.numEnabledTriggers;
		timerSettingsNext.Triggers.numEnabledTriggers++;
	} else {
		timerSettingsNext.Triggers.OFF.Enabled = false;
	}
	timerSettingsNext.Triggers.ON.Location = sampleLocation1;
	timerSettingsNext.Triggers.OFF.Location = sampleLocation2;

	// When we sample in every cycle the DMA is not triggered periodically but only configured and enabled once. So we need to reconfigure the DMA if we changed the number of triggers
	if (SAMPLE_IN_EVERY_PWM_CYCLE && timerSettingsNext.Triggers.numEnabledTriggers != timerSettingsCurrent.Triggers.numEnabledTriggers) {
		RestartSampling();
	}
}

void SyncedPWMADC::TimerCaptureCallback(SyncedPWMADC * obj)
{
	//if (!obj) return; // currently commented out for speed

