mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
	if (obj->samplingPin) {
		if (obj->SAMPLE_IN_EVERY_PWM_CYCLE || obj->_DMA_ADC1_ongoing || obj->_DMA_ADC2_ongoing) {

			if ((__HAL_TIM_GET_FLAG(&obj->hTimer, TIM_FLAG_CC2) != RESET && obj->timerSettingsNext.Triggers.ON.Enabled) ||
				(__HAL_TIM_GET_FLAG(&obj->hTimer, TIM_FLAG_CC4) != RESET && obj->timerSettingsNext.Triggers.OFF.Enabled))
			{
				obj->samplingPin->High();
			}
		}
	}
}

void SyncedPWMADC::TriggerSample(SyncedPWMADC * obj)
{
	if (!obj) return;

	/* Called by the Timer Update interrupt vector to trigger/initiate a DMA sample */

	if (obj->_DMA_ADC1_ongoing || obj->_DMA_ADC2_ongoing) return; // Previous conversion not finished yet
	if (obj->hDMA_ADC1.State != HAL_DMA_STATE_READY || obj->hDMA_ADC2.State != HAL_DMA_STATE_READY) return;

	// Latch timer settings since we now start the next period
	obj->timerSettingsCurrent = obj->timerSettingsNext;

	/* Start/Trigger the ADC1 DMA */
	if (obj->hDMA_ADC1.State != HAL_DMA_STATE_READY) {
		HAL_DMA_Abort(&obj->hDMA_ADC1);
	}
	__HAL_ADC_CLEAR_FLAG(&obj->hADC1, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));
	HAL_DMA_Start_IT(&obj->hDMA_ADC1, (uint32_t)&obj->hADC1.Instance->DR, (uint32_t)&obj->_ADC1_buffer[0], obj->_samplingNumSamples*obj->timerSettingsCurrent.Triggers.numEnabledTriggers*obj->Channels.ADCnumChannels[0]);
	LL_ADC_REG_StartConversion(obj->hADC1.Instance);
	obj->_DMA_ADC1_ongoing = 1;

	/* Start/Trigger the ADC2 DMA */
	if (obj->hDMA_ADC2.State != HAL_DMA_STATE_READY) {
		HAL_DMA_Abort(&obj->hDMA_ADC2);
	}
	__HAL_ADC_CLEAR_FLAG(&obj->hADC2, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));
	HAL_DMA_Start_IT(&obj->hDMA_ADC2, (uint32_t)&obj->hADC2.Instance->DR, (uint32_t)&obj->_ADC2_buffer[0], obj->_samplingNumSamples*obj->timerSettingsCurrent.Triggers.numEnabledTriggers*obj->Channels.ADCnumChannels[1]);
	LL_ADC_REG_StartConversion(obj->hADC2.Instance);
	obj->_DMA_ADC2_ongoing = 1;

	if (!obj->_SamplingEnabled) {
		// Interrupt called for the first time
		obj->_SamplingEnabled = 1;

		/* Enable ADC DMA mode */
		SET_BIT(obj->hADC1.Instance->CFGR, ADC_CFGR_DMAEN);
		SET_BIT(obj->hADC2.Instance->CFGR, ADC_CFGR_DMAEN);

		if (obj->SAMPLE_IN_EVERY_PWM_CYCLE) {
			// When sampling in every sample we only need to enable the DMA once
			// And then we disable the interrupt since it is now running
			__HAL_TIM_DISABLE_IT(&obj->hTimer, TIM_IT_UPDATE);
		}
		return;
	}
}

// ToDo: OBS! It's a very bad idea to put these callbacks in here.
// Consider to enable callback registration mechanism within HAL library or to handle the interrupt manually.
// ADC conversion completed interrupt
// Called from the ADC_DMAConvCplt when the DMA conversion is done
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
	if (SyncedPWMADC::globalObject)
	{
		if (hadc->Instance == ADC1) {
			SyncedPWMADC::SamplingCompleted(SyncedPWMADC::globalObject, 1);
		} else if (hadc->Instance == ADC2) {
			SyncedPWMADC::SamplingCompleted(SyncedPWMADC::globalObject, 2);
		}
	}
}

void SyncedPWMADC::SamplingCompleted(SyncedPWMADC * obj, uint8_t ADC)
{
	if (!obj) return;

	if (obj->samplingPin) {
		obj->samplingPin->Low();
	}

	if (!obj->SAMPLE_IN_EVERY_PWM_CYCLE) {
		if (ADC == 1) {
			obj->_DMA_ADC1_ongoing = 0;
			LL_ADC_REG_StopConversion(obj->hADC1.Instance);
		}
		else if (ADC == 2) {
			obj->_DMA_ADC2_ongoing = 0;
			LL_ADC_REG_StopConversion(obj->hADC2.Instance);
		}
	}

	if (obj->SAMPLE_IN_EVERY_PWM_CYCLE ||
	   (obj->_DMA_ADC1_ongoing == 0 && obj->_DMA_ADC2_ongoing == 0)) {
		// Compute Vref voltage (based on __LL_ADC_CALC_VREFANALOG_VOLTAGE - with 12-bit ADC resolution)
		uint16_t * buf;
		uint8_t nc;
		uint32_t timestamp = HAL_GetHighResTick();

		if (obj->Channels.VREF.ADC) {
			if (obj->Channels.VREF.ADC == 1) {
				buf = obj->_ADC1_buffer;
				nc = obj->Channels.ADCnumChannels[0];
			} else {
				buf = obj->_ADC2_buffer;
				nc = obj->Channels.ADCnumChannels[1];
			}
			obj->Samples.Vref.Timestamp = timestamp;
			if (obj->timerSettingsCurrent.Triggers.ON.Enabled)
				obj->Samples.Vref.ValueON = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc];
			if (obj->timerSettingsCurrent.Triggers.OFF.Enabled)
				obj->Samples.Vref.ValueOFF = 0.001f * (float)((uint32_t)(*VREFINT_CAL_ADDR) * VREFINT_CAL_VREF) / (float)buf[obj->Channels.VREF.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc];
		}

		if (obj->timerSettingsCurrent.Direction) { // Forward
			// Current sense from VSENSE1 since CH1 is LOW at all times
			if (obj->Channels.VSENSE1.ADC) {
				if (obj->Channels.VSENSE1.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}
				obj->Samples.CurrentSense.Timestamp = timestamp;
				if (obj->timerSettingsCurrent.Triggers.ON.Enabled)
					obj->Samples.CurrentSense.ValueON = obj->Samples.Vref.ValueON * (float)buf[obj->Channels.VSENSE1.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc] / 4096.f;
				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled)
					obj->Samples.CurrentSense.ValueOFF = obj->Samples.Vref.ValueOFF * (float)buf[obj->Channels.VSENSE1.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc] / 4096.f;
			}
		} else { // Backward
			// Current sense from VSENSE3 since CH3 is LOW at all times
			if (obj->Channels.VSENSE3.ADC) {
				if (obj->Channels.VSENSE3.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}
				obj->Samples.CurrentSense.Timestamp = timestamp;
				if (obj->timerSettingsCurrent.Triggers.ON.Enabled)
					obj->Samples.CurrentSense.ValueON = obj->Samples.Vref.ValueON * (float)buf[obj->Channels.VSENSE3.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc] / 4096.f;
				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled)
					obj->Samples.CurrentSense.ValueOFF = obj->Samples.Vref.ValueOFF * (float)buf[obj->Channels.VSENSE3.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc] / 4096.f;
			}
		}

		if (obj->timerSettingsCurrent.Direction) { // Forward
			// In forward direction it is CH3,CH3N that changes.
			// During COAST mode CH3N is forced to be LOW at all times, causing LOW PWM to deactivate the CH3,CH3N MOSFET
			// Back-EMF should thus be sampled from OUT3 = BEMF3
			if (obj->Channels.BEMF3.ADC) {
				if (obj->Channels.BEMF3.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}
				obj->Samples.Bemf.Timestamp = timestamp;

				if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
					float v_bemf = obj->Samples.Vref.ValueON * (float)buf[obj->Channels.BEMF3.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc] / 4096.f;
					obj->Samples.Bemf.ValueON = (v_bemf - 0.1f) * (2.2f+10.f)/2.2f + 0.1f;
				}

				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
					float v_bemf = obj->Samples.Vref.ValueOFF * (float)buf[obj->Channels.BEMF3.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc] / 4096.f;
					obj->Samples.Bemf.ValueOFF = (v_bemf - 0.1f) * (2.2f+10.f)/2.2f + 0.1f;
				}

