mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC.cpp
			}
		} else { // Backward
			// In backward direction it is CH1,CH1N that changes.
			// During COAST mode CH1N is forced to be LOW at all times, causing LOW PWM to deactivate the CH1,CH1N MOSFET
			// Back-EMF should thus be sampled from OUT1 = BEMF1
			if (obj->Channels.BEMF1.ADC) {
				if (obj->Channels.BEMF1.ADC == 1) {
					buf = obj->_ADC1_buffer;
					nc = obj->Channels.ADCnumChannels[0];
				} else {
					buf = obj->_ADC2_buffer;
					nc = obj->Channels.ADCnumChannels[1];
				}
				obj->Samples.Bemf.Timestamp = timestamp;

				if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
					float v_bemf = obj->Samples.Vref.ValueON * (float)buf[obj->Channels.BEMF1.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc] / 4096.f;
					obj->Samples.Bemf.ValueON = (v_bemf - 0.1f) * (2.2f+10.f)/2.2f + 0.1f;
				}

				if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
					float v_bemf = obj->Samples.Vref.ValueOFF * (float)buf[obj->Channels.BEMF1.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc] / 4096.f;
					obj->Samples.Bemf.ValueOFF = (v_bemf - 0.1f) * (2.2f+10.f)/2.2f + 0.1f;
				}
			}
		}

		if (obj->Channels.VBUS.ADC) {
			if (obj->Channels.VBUS.ADC == 1) {
				buf = obj->_ADC1_buffer;
				nc = obj->Channels.ADCnumChannels[0];
			} else {
				buf = obj->_ADC2_buffer;
				nc = obj->Channels.ADCnumChannels[1];
			}

			obj->Samples.Vbus.Timestamp = timestamp;

			if (obj->timerSettingsCurrent.Triggers.ON.Enabled) {
				float v_vbus = obj->Samples.Vref.ValueON * (float)buf[obj->Channels.VBUS.Index + obj->timerSettingsCurrent.Triggers.ON.Index*nc] / 4096.f;
				obj->Samples.Vbus.ValueON = v_vbus * (18.f+169.f)/18.f;
			}

			if (obj->timerSettingsCurrent.Triggers.OFF.Enabled) {
				float v_vbus = obj->Samples.Vref.ValueOFF * (float)buf[obj->Channels.VBUS.Index + obj->timerSettingsCurrent.Triggers.OFF.Index*nc] / 4096.f;
				obj->Samples.Vbus.ValueOFF = v_vbus * (18.f+169.f)/18.f;
			}
		}

		// Latch here instead of in TriggerSample function when we sample in every PWM cycle, since TriggerSample won't be called in that case
		if (obj->SAMPLE_IN_EVERY_PWM_CYCLE) {
			// Latch timer settings since we now start the next period
			obj->timerSettingsCurrent = obj->timerSettingsNext;
		}

#ifdef USE_FREERTOS
		portBASE_TYPE xHigherPriorityTaskWoken;
		if (obj->_sampleAvailable)
			xSemaphoreGiveFromISR( obj->_sampleAvailable, &xHigherPriorityTaskWoken );
		portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
#else
		_sampleAvailable = true;
#endif
	}
}

void SyncedPWMADC::Debug_SetSamplingPin(IO * pin)
{
	if (DEBUG_MODE_ENABLED && pin) {
		samplingPin = pin;
	}
}

void SyncedPWMADC::WaitForNewSample()
{
#ifdef USE_FREERTOS
	xSemaphoreTake( _sampleAvailable, ( TickType_t ) portMAX_DELAY );
#endif
	while (!_sampleAvailable) {
		osDelay(1);
	}
}

SyncedPWMADC::Sample SyncedPWMADC::GetCurrent()
{
	return Samples.CurrentSense;
}

SyncedPWMADC::Sample SyncedPWMADC::GetVin()
{
	return Samples.Vbus;
}

SyncedPWMADC::Sample SyncedPWMADC::GetBemf()
{
	return Samples.Bemf;
}

SyncedPWMADC::SampleSingle SyncedPWMADC::GetPotentiometer()
{
	return SampleSingle();
}
